In [ ]:
import pandas as pd

In [70]:
import pandas as pd

s = pd.Series([1, 3, 5, 7, 9],index=['a', 'b', 'c', 'd', 'e'])
print(s)

a    1
b    3
c    5
d    7
e    9
dtype: int64

In [71]:
s.iloc[0]=10
print(s)

a    10
b     3
c     5
d     7
e     9
dtype: int64

In [72]:
score={"Jane":90, "Bill":80,"Elon":85,"Tom":75,"Tim":95}
names=pd.Series(score) # Convert to Series 
names

Jane    90
Bill    80
Elon    85
Tom     75
Tim     95
dtype: int64

In [73]:
names.loc["Jane":"Tom"]

Jane    90
Bill    80
Elon    85
Tom     75
dtype: int64

In [74]:
names.loc[names>80]

Jane    90
Elon    85
Tim     95
dtype: int64

In [75]:
names.drop("Bill")
names

Jane    90
Bill    80
Elon    85
Tom     75
Tim     95
dtype: int64

In [76]:
data={"name":["Bill","Tom","Tim","John","Alex","Vanessa","Kate"],      
      "score":[90,80,85,75,95,60,65],      
      "sport":["Wrestling","Football","Skiing","Swimming","Tennis",
               "Karete","Surfing"],      
      "sex":["M","M","M","M","F","F","F"]}
info=pd.DataFrame(data)
info

      name  score      sport sex
0     Bill     90  Wrestling   M
1      Tom     80   Football   M
2      Tim     85     Skiing   M
3     John     75   Swimming   M
4     Alex     95     Tennis   F
5  Vanessa     60     Karete   F
6     Kate     65    Surfing   F

In [77]:
info[info.score>90]

   name  score   sport sex
4  Alex     95  Tennis   F

In [78]:
info.head(3)

   name  score      sport sex
0  Bill     90  Wrestling   M
1   Tom     80   Football   M
2   Tim     85     Skiing   M

In [79]:
info.tail(2)

      name  score    sport sex
5  Vanessa     60   Karete   F
6     Kate     65  Surfing   F

In [80]:
info.head(7)

      name  score      sport sex
0     Bill     90  Wrestling   M
1      Tom     80   Football   M
2      Tim     85     Skiing   M
3     John     75   Swimming   M
4     Alex     95     Tennis   F
5  Vanessa     60     Karete   F
6     Kate     65    Surfing   F

In [81]:
info.columns

Index(['name', 'score', 'sport', 'sex'], dtype='object')

In [82]:
info.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    7 non-null      object
 1   score   7 non-null      int64
 2   sport   7 non-null      object
 3   sex     7 non-null      object
dtypes: int64(1), object(3)
memory usage: 356.0+ bytes

In [83]:
info.describe()

           score
count   7.000000
mean   78.571429
std    12.817399
min    60.000000
25%    70.000000
50%    80.000000
75%    87.500000
max    95.000000

In [84]:
info.dtypes

name     object
score     int64
sport    object
sex      object
dtype: object

In [85]:
info.score.mean()

np.float64(78.57142857142857)

In [86]:
info.isnull()

    name  score  sport    sex
0  False  False  False  False
1  False  False  False  False
2  False  False  False  False
3  False  False  False  False
4  False  False  False  False
5  False  False  False  False
6  False  False  False  False

In [87]:
info.isnull().sum()

name     0
score    0
sport    0
sex      0
dtype: int64

In [89]:
info["age"]= [20, 30, 35, 60, 45, 50, 55]
info

      name  score      sport sex  age
0     Bill     90  Wrestling   M   20
1      Tom     80   Football   M   30
2      Tim     85     Skiing   M   35
3     John     75   Swimming   M   60
4     Alex     95     Tennis   F   45
5  Vanessa     60     Karete   F   50
6     Kate     65    Surfing   F   55

In [106]:
info.loc[0:2,["name","score","age"]]

   name  score  age
0  Bill     90   20
1   Tom     80   30
2   Tim     85   35

In [110]:
info.iloc[0:3,0:3]

   name  score      sport
0  Bill     90  Wrestling
1   Tom     80   Football
2   Tim     85     Skiing

In [114]:
import numpy as np
df=pd.DataFrame(
    {"key1":list("aabbab"),
     "key2":["one","two","three"]*2,
     "data1":np.random.randn(6),
     "data2":np.random.randn(6)})
df

  key1   key2     data1     data2
0    a    one  1.301899  1.056287
1    a    two  0.083641 -0.227468
2    b  three -0.197889 -1.975438
3    b    one  0.479825  0.622402
4    a    two -0.116869 -0.373772
5    b  three -0.552933  0.934817

In [123]:

df.groupby['key1']['data1'].mean()

TypeError: 'method' object is not subscriptable